In [41]:
import pandas as pd
import numpy as np
import random as rd
from datetime import datetime as dt

In [42]:
def get_football_team(n_players, mean_shoe, mean_jersey):
    shoe_sizes = np.random.normal(size = n_players, loc = mean_shoe, scale =.10 * mean_shoe)
    jersey_sizes = mean_jersey / mean_shoe * shoe_sizes + np.random.normal(size = n_players, scale = .05 * mean_jersey)
    
    return shoe_sizes, jersey_sizes

In [43]:
players = ['Messi', 'Cristiano', 'Maradona', 'Pele', 'Ronaldo DeLima', 'Zinedine Zidane', 'Thierry Henry', 'Samuel Eto', 'Ruud Van Nistelrooy']

shoes, jerseys = get_football_team(len(players), 46, 11)
shoes

array([44.11468378, 49.80239502, 45.64912507, 44.59570295, 51.75616047,
       52.48023055, 36.30547885, 43.38460017, 43.46610106])

In [44]:
jerseys

array([10.00561887, 11.36750197,  9.68435238, 10.89901249, 12.59618155,
       12.45636959,  8.39013342,  9.92010285,  9.94108995])

In [47]:
pd.DataFrame(index = players, data = { 'shoe': shoes, 'jerseys': jerseys})

                          shoe    jerseys
Messi                44.114684  10.005619
Cristiano            49.802395  11.367502
Maradona             45.649125   9.684352
Pele                 44.595703  10.899012
Ronaldo DeLima       51.756160  12.596182
Zinedine Zidane      52.480231  12.456370
Thierry Henry        36.305479   8.390133
Samuel Eto           43.384600   9.920103
Ruud Van Nistelrooy  43.466101   9.941090

In [48]:
data = pd.DataFrame(index = players, data = zip(shoes, jerseys), columns = ['shoesize', 'jersey'])
data

                      shoesize     jersey
Messi                44.114684  10.005619
Cristiano            49.802395  11.367502
Maradona             45.649125   9.684352
Pele                 44.595703  10.899012
Ronaldo DeLima       51.756160  12.596182
Zinedine Zidane      52.480231  12.456370
Thierry Henry        36.305479   8.390133
Samuel Eto           43.384600   9.920103
Ruud Van Nistelrooy  43.466101   9.941090

In [49]:
ages = [rd.choice(range(30, 40)) for i in players]
ages

[39, 39, 38, 32, 33, 39, 39, 30, 38]

In [50]:
data['ages'] = ages

In [51]:
data

                      shoesize     jersey  ages
Messi                44.114684  10.005619    39
Cristiano            49.802395  11.367502    39
Maradona             45.649125   9.684352    38
Pele                 44.595703  10.899012    32
Ronaldo DeLima       51.756160  12.596182    33
Zinedine Zidane      52.480231  12.456370    39
Thierry Henry        36.305479   8.390133    39
Samuel Eto           43.384600   9.920103    30
Ruud Van Nistelrooy  43.466101   9.941090    38

In [52]:
data.loc['Messi']

shoesize    44.114684
jersey      10.005619
ages        39.000000
Name: Messi, dtype: float64

In [53]:
data.iloc[1]

shoesize    49.802395
jersey      11.367502
ages        39.000000
Name: Cristiano, dtype: float64

In [54]:
data.loc[['Messi', 'Maradona']]

           shoesize     jersey  ages
Messi     44.114684  10.005619    39
Maradona  45.649125   9.684352    38

In [55]:
data.loc[['Messi', 'Maradona'], 'ages']

Messi       39
Maradona    38
Name: ages, dtype: int64

In [64]:
data.loc['Collins'] = {'jersey': 9, 'shoesize': 42, 'ages': 93}
print(f"""
    \n {data.info()}, \n
    \n {data.mean(1)}, \n
    \n {data.value_counts()}, \n
    \n {data.loc['Collins']} \n
""")

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, Messi to Collins
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   shoesize  10 non-null     float64
 1   jersey    10 non-null     float64
dtypes: float64(2)
memory usage: 540.0+ bytes


 None,


 Messi                  27.060151
Cristiano              30.584948
Maradona               27.666739
Pele                   27.747358
Ronaldo DeLima         32.176171
Zinedine Zidane        32.468300
Thierry Henry          22.347806
Samuel Eto             26.652352
Ruud Van Nistelrooy    26.703596
Collins                25.500000
dtype: float64,


 shoesize   jersey
36.305479  8.390133     1
42.000000  9.000000     1
43.384600  9.920103     1
43.466101  9.941090     1
44.114684  10.005619    1
44.595703  10.899012    1
45.649125  9.684352     1
49.802395  11.367502    1
51.756160  12.596182    1
52.480231  12.456370    1
dtype: int64,


 shoesize    42.0
jersey       9.0
Name: Collins, dtype: float64

In [65]:
names = ["Maya", 'DiMarco', 'Montrezz', 'Filipa', 'Mina']
age = [rd.choice(range(21, 31)) for i in names]
gender = [rd.choice(['male', 'female']) for i in players]

data = pd.DataFrame(index = names, data = zip(age, gender), columns = {'age', 'gender'})
data

          age  gender
Maya       28    male
DiMarco    24  female
Montrezz   28  female
Filipa     21    male
Mina       27  female

In [66]:
data.age.mean()

25.6

In [67]:
data.gender.value_counts()

female    3
male      2
Name: gender, dtype: int64

##### Opening files with pandas

In [68]:
dataset = pd.read_csv("../fileInpOut/ecorp data.csv")
dataset.head()

                 name    sales      date
0    Sebastian Waite    607193  1/1/2020
1     Lizzie Haggins   1171366  1/1/2020
2       Ima Gaudreau    941504  1/1/2020
3  Leticia Michelsen    721826  1/1/2020
4   Stanley Margolin    904494  1/1/2020

In [69]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10050 entries, 0 to 10049
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    10050 non-null  object
 1   sales   10050 non-null  int64
 2   date    10050 non-null  object
dtypes: int64(1), object(2)
memory usage: 235.7+ KB

In [70]:
new_date = pd.DatetimeIndex(dataset.date)
dataset['month'] = new_date.month

In [72]:
jan_sales = dataset[dataset['month'] == 1].sales
sum(jan_sales)

655183239

In [73]:
monthlySales = dataset.groupby('month').sum()
monthlySales

           sales
month
1      655183239
2      635788599
3      663589193
4      656047811
5      686790421
6      639247236
7      651061643
8      681564905
9      660549418
10     644783452
11     654405687
12     246458509

In [74]:
monthlySales = dataset.groupby('month').count()
monthlySales

       name  sales  date
month
1       879    879   879
2       883    883   883
3       898    898   898
4       884    884   884
5       927    927   927
6       856    856   856
7       862    862   862
8       929    929   929
9       875    875   875
10      853    853   853
11      861    861   861
12      343    343   343

In [98]:
agent_totalSales = dataset.groupby('name').sum()
agent_totalSales

                         sales  month
name
Aaron Killingsworth   19507476    164
Adam Riggleman          287649     11
Adeline Mey            7190988     77
Adrianna Sweetland    19639165    138
Adriene Gauldin       13862581    102
...                        ...    ...
Zella Blahnik           742769      9
Zenaida Israel        21394436    184
Zola Gaus             15839678    168
Zora Lodge             8904010     88
Zoraida Gertner       11475370     93

[549 rows x 2 columns]

In [93]:
agent_totalSales.sort_values('sales', ascending = False )

                     sales  month
name
Shae Buggs        26302482    176
Linnea Molton     24737049    169
Jerrod Lemonds    24185171    179
Georgine Aigner   23973581    141
Bettina Panetta   23905250    175
...                    ...    ...
Niki Millar          70328      4
Letitia Gan          59730      3
Una Loll             59284      1
Trudy Hennis         56588      3
Darby Nakken         12552      8

[549 rows x 2 columns]

In [95]:
agent_totalSales['sales']

name
Aaron Killingsworth     19507476
Adam Riggleman            287649
Adeline Mey              7190988
Adrianna Sweetland      19639165
Adriene Gauldin         13862581
                          ...
Zella Blahnik             742769
Zenaida Israel          21394436
Zola Gaus               15839678
Zora Lodge               8904010
Zoraida Gertner         11475370
Name: sales, Length: 549, dtype: int64

In [99]:
agent_saleslist = agent_totalSales['sales']
agent_saleslist.argmax()

461

In [100]:
agent_saleslist.iloc[461]

26302482

In [101]:
agent_saleslist.index[461]

'Shae Buggs '

In [109]:
name_monthdata = dataset.groupby(['name', 'month']).sum() 
name_monthdata

                              sales
name                 month
Aaron Killingsworth  1      2286768
                     2      1270823
                     3       874816
                     4      3000688
                     5      1547557
...                             ...
Zoraida Gertner      5       877376
                     6      1383690
                     7       237819
                     10     2662930
                     11     1690600

[4802 rows x 1 columns]